; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l34_p34_c34_g34)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 refugio31 refugio32 refugio33 refugio34 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 person31 person32 person33 person34 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 comida)
	(at-box box19 deposito)
	(box-has box19 comida)
	(at-box box20 deposito)
	(box-has box20 comida)
	(at-box box21 deposito)
	(box-has box21 comida)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-box box31 deposito)
	(box-has box31 medicina)
	(at-box box32 deposito)
	(box-has box32 medicina)
	(at-box box33 deposito)
	(box-has box33 medicina)
	(at-box box34 deposito)
	(box-has box34 medicina)
	(at-person person1 refugio21)
	(at-person person2 refugio34)
	(at-person person3 refugio8)
	(at-person person4 refugio14)
	(at-person person5 refugio17)
	(at-person person6 refugio10)
	(at-person person7 refugio16)
	(at-person person8 refugio34)
	(at-person person9 refugio30)
	(at-person person10 refugio23)
	(at-person person11 refugio10)
	(at-person person12 refugio5)
	(at-person person13 refugio29)
	(at-person person14 refugio19)
	(at-person person15 refugio9)
	(at-person person16 refugio5)
	(at-person person17 refugio8)
	(at-person person18 refugio5)
	(at-person person19 refugio7)
	(at-person person20 refugio4)
	(at-person person21 refugio19)
	(at-person person22 refugio3)
	(at-person person23 refugio11)
	(at-person person24 refugio9)
	(at-person person25 refugio13)
	(at-person person26 refugio18)
	(at-person person27 refugio11)
	(at-person person28 refugio3)
	(at-person person29 refugio12)
	(at-person person30 refugio20)
	(at-person person31 refugio18)
	(at-person person32 refugio7)
	(at-person person33 refugio23)
	(at-person person34 refugio12)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person4 comida)
	(person-has person5 medicina)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person9 medicina)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person11 medicina)
	(person-has person12 comida)
	(person-has person15 comida)
	(person-has person16 comida)
	(person-has person17 comida)
	(person-has person19 medicina)
	(person-has person20 comida)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person22 comida)
	(person-has person23 comida)
	(person-has person24 comida)
	(person-has person24 medicina)
	(person-has person25 comida)
	(person-has person26 comida)
	(person-has person28 medicina)
	(person-has person29 comida)
	(person-has person30 comida)
	(person-has person30 medicina)
	(person-has person31 comida)
	(person-has person31 medicina)
	(person-has person33 medicina)
	(person-has person34 comida)
))
)

; plan
1. (pick box34 deposito dron1-der dron1)
   deleted: (at-box box34 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box34)
   goals met: 0 of 34
2. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 0 of 34
3. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 0 of 34
4. (leave box21 refugio21 dron1-izq dron1 person1 comida)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 comida)
   added: (at-box box21 refugio21) (free dron1-izq) (person-has person1 comida)
   goals met: 1 of 34
5. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 1 of 34
6. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 1 of 34
7. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 1 of 34
8. (leave box20 refugio14 dron1-izq dron1 person4 comida)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 comida)
   added: (at-box box20 refugio14) (free dron1-izq) (person-has person4 comida)
   goals met: 2 of 34
9. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 2 of 34
10. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 2 of 34
11. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 2 of 34
12. (leave box34 refugio17 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box34) (box-has box34 medicina)
   added: (at-box box34 refugio17) (free dron1-der) (person-has person5 medicina)
   goals met: 3 of 34
13. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 3 of 34
14. (pick box33 deposito dron1-der dron1)
   deleted: (at-box box33 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box33)
   goals met: 3 of 34
15. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 3 of 34
16. (leave box19 refugio16 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 comida)
   added: (at-box box19 refugio16) (free dron1-izq) (person-has person7 comida)
   goals met: 4 of 34
17. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 4 of 34
18. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 4 of 34
19. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 4 of 34
20. (move refugio34 refugio8 dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 refugio8)
   goals met: 4 of 34
21. (leave box18 refugio8 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 comida)
   added: (at-box box18 refugio8) (free dron1-izq) (person-has person17 comida)
   goals met: 5 of 34
22. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 5 of 34
23. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 5 of 34
24. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 5 of 34
25. (move refugio34 refugio7 dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 refugio7)
   goals met: 5 of 34
26. (leave box33 refugio7 dron1-der dron1 person19 medicina)
   deleted: (carrying dron1 dron1-der box33) (box-has box33 medicina)
   added: (at-box box33 refugio7) (free dron1-der) (person-has person19 medicina)
   goals met: 6 of 34
27. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 6 of 34
28. (pick box32 deposito dron1-der dron1)
   deleted: (at-box box32 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box32)
   goals met: 6 of 34
29. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 6 of 34
30. (move refugio34 refugio19 dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 refugio19)
   goals met: 6 of 34
31. (leave box17 refugio19 dron1-izq dron1 person21 comida)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 comida)
   added: (at-box box17 refugio19) (free dron1-izq) (person-has person21 comida)
   goals met: 7 of 34
32. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 7 of 34
33. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 7 of 34
34. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 7 of 34
35. (move refugio34 refugio11 dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 refugio11)
   goals met: 7 of 34
36. (leave box16 refugio11 dron1-izq dron1 person23 comida)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 comida)
   added: (at-box box16 refugio11) (free dron1-izq) (person-has person23 comida)
   goals met: 8 of 34
37. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 8 of 34
38. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 8 of 34
39. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 8 of 34
40. (move refugio34 refugio13 dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 refugio13)
   goals met: 8 of 34
41. (leave box15 refugio13 dron1-izq dron1 person25 comida)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 comida)
   added: (at-box box15 refugio13) (free dron1-izq) (person-has person25 comida)
   goals met: 9 of 34
42. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 9 of 34
43. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 9 of 34
44. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 9 of 34
45. (leave box14 refugio34 dron1-izq dron1 person2 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio34) (free dron1-izq) (person-has person2 comida)
   goals met: 10 of 34
46. (move refugio34 deposito dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 deposito)
   goals met: 10 of 34
47. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 10 of 34
48. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 10 of 34
49. (leave box32 refugio34 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box32) (box-has box32 medicina)
   added: (at-box box32 refugio34) (free dron1-der) (person-has person8 medicina)
   goals met: 11 of 34
50. (move refugio34 deposito dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 deposito)
   goals met: 11 of 34
51. (pick box31 deposito dron1-der dron1)
   deleted: (at-box box31 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box31)
   goals met: 11 of 34
52. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 11 of 34
53. (leave box13 refugio30 dron1-izq dron1 person9 comida)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 comida)
   added: (at-box box13 refugio30) (free dron1-izq) (person-has person9 comida)
   goals met: 12 of 34
54. (move refugio30 deposito dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 deposito)
   goals met: 12 of 34
55. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 12 of 34
56. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 12 of 34
57. (leave box31 refugio30 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box31) (box-has box31 medicina)
   added: (at-box box31 refugio30) (free dron1-der) (person-has person9 medicina)
   goals met: 13 of 34
58. (move refugio30 deposito dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 deposito)
   goals met: 13 of 34
59. (pick box30 deposito dron1-der dron1)
   deleted: (at-box box30 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box30)
   goals met: 13 of 34
60. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 13 of 34
61. (leave box30 refugio10 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box30) (box-has box30 medicina)
   added: (at-box box30 refugio10) (free dron1-der) (person-has person6 medicina)
   goals met: 14 of 34
62. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 14 of 34
63. (pick box29 deposito dron1-der dron1)
   deleted: (at-box box29 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box29)
   goals met: 14 of 34
64. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 14 of 34
65. (leave box29 refugio10 dron1-der dron1 person11 medicina)
   deleted: (carrying dron1 dron1-der box29) (box-has box29 medicina)
   added: (at-box box29 refugio10) (free dron1-der) (person-has person11 medicina)
   goals met: 15 of 34
66. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 15 of 34
67. (pick box28 deposito dron1-der dron1)
   deleted: (at-box box28 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box28)
   goals met: 15 of 34
68. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 15 of 34
69. (leave box12 refugio5 dron1-izq dron1 person12 comida)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 comida)
   added: (at-box box12 refugio5) (free dron1-izq) (person-has person12 comida)
   goals met: 16 of 34
70. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 16 of 34
71. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 16 of 34
72. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 16 of 34
73. (leave box11 refugio5 dron1-izq dron1 person16 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio5) (free dron1-izq) (person-has person16 comida)
   goals met: 17 of 34
74. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 17 of 34
75. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 17 of 34
76. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 17 of 34
77. (leave box10 refugio4 dron1-izq dron1 person20 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio4) (free dron1-izq) (person-has person20 comida)
   goals met: 18 of 34
78. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 18 of 34
79. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 18 of 34
80. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 18 of 34
81. (leave box28 refugio4 dron1-der dron1 person20 medicina)
   deleted: (carrying dron1 dron1-der box28) (box-has box28 medicina)
   added: (at-box box28 refugio4) (free dron1-der) (person-has person20 medicina)
   goals met: 19 of 34
82. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 19 of 34
83. (pick box27 deposito dron1-der dron1)
   deleted: (at-box box27 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box27)
   goals met: 19 of 34
84. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 19 of 34
85. (leave box9 refugio9 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio9) (free dron1-izq) (person-has person15 comida)
   goals met: 20 of 34
86. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 20 of 34
87. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 20 of 34
88. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 20 of 34
89. (leave box8 refugio9 dron1-izq dron1 person24 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio9) (free dron1-izq) (person-has person24 comida)
   goals met: 21 of 34
90. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 21 of 34
91. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 21 of 34
92. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 21 of 34
93. (leave box27 refugio9 dron1-der dron1 person24 medicina)
   deleted: (carrying dron1 dron1-der box27) (box-has box27 medicina)
   added: (at-box box27 refugio9) (free dron1-der) (person-has person24 medicina)
   goals met: 22 of 34
94. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 22 of 34
95. (pick box26 deposito dron1-der dron1)
   deleted: (at-box box26 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box26)
   goals met: 22 of 34
96. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 22 of 34
97. (leave box7 refugio3 dron1-izq dron1 person22 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio3) (free dron1-izq) (person-has person22 comida)
   goals met: 23 of 34
98. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 23 of 34
99. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 23 of 34
100. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 23 of 34
101. (leave box26 refugio3 dron1-der dron1 person28 medicina)
   deleted: (carrying dron1 dron1-der box26) (box-has box26 medicina)
   added: (at-box box26 refugio3) (free dron1-der) (person-has person28 medicina)
   goals met: 24 of 34
102. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 24 of 34
103. (pick box25 deposito dron1-der dron1)
   deleted: (at-box box25 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box25)
   goals met: 24 of 34
104. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 24 of 34
105. (leave box6 refugio20 dron1-izq dron1 person30 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio20) (free dron1-izq) (person-has person30 comida)
   goals met: 25 of 34
106. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 25 of 34
107. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 25 of 34
108. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 25 of 34
109. (leave box25 refugio20 dron1-der dron1 person30 medicina)
   deleted: (carrying dron1 dron1-der box25) (box-has box25 medicina)
   added: (at-box box25 refugio20) (free dron1-der) (person-has person30 medicina)
   goals met: 26 of 34
110. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 26 of 34
111. (pick box24 deposito dron1-der dron1)
   deleted: (at-box box24 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box24)
   goals met: 26 of 34
112. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 26 of 34
113. (leave box5 refugio18 dron1-izq dron1 person26 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio18) (free dron1-izq) (person-has person26 comida)
   goals met: 27 of 34
114. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 27 of 34
115. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 27 of 34
116. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 27 of 34
117. (leave box4 refugio18 dron1-izq dron1 person31 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio18) (free dron1-izq) (person-has person31 comida)
   goals met: 28 of 34
118. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 28 of 34
119. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 28 of 34
120. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 28 of 34
121. (leave box24 refugio18 dron1-der dron1 person31 medicina)
   deleted: (carrying dron1 dron1-der box24) (box-has box24 medicina)
   added: (at-box box24 refugio18) (free dron1-der) (person-has person31 medicina)
   goals met: 29 of 34
122. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 29 of 34
123. (pick box23 deposito dron1-der dron1)
   deleted: (at-box box23 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box23)
   goals met: 29 of 34
124. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 29 of 34
125. (leave box3 refugio23 dron1-izq dron1 person10 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio23) (free dron1-izq) (person-has person10 comida)
   goals met: 30 of 34
126. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 30 of 34
127. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 30 of 34
128. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 30 of 34
129. (leave box23 refugio23 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box23) (box-has box23 medicina)
   added: (at-box box23 refugio23) (free dron1-der) (person-has person10 medicina)
   goals met: 31 of 34
130. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 31 of 34
131. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 31 of 34
132. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 31 of 34
133. (leave box22 refugio23 dron1-der dron1 person33 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio23) (free dron1-der) (person-has person33 medicina)
   goals met: 32 of 34
134. (move refugio23 refugio12 dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 refugio12)
   goals met: 32 of 34
135. (leave box2 refugio12 dron1-izq dron1 person29 comida)
   deleted: (carrying dron1 dron1-izq box2) (box-has box2 comida)
   added: (at-box box2 refugio12) (free dron1-izq) (person-has person29 comida)
   goals met: 33 of 34
136. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 33 of 34
137. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 33 of 34
138. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 33 of 34
139. (leave box1 refugio12 dron1-der dron1 person34 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio12) (free dron1-der) (person-has person34 comida)
   goals met: 34 of 34
